Repository: wp-plugins/sqlite-cache
Catalog: languages/litecache-*.po
Languages: ru_ru, uk

source: SQLite Cache Settings
ru_ru: Настройки SQLite кэширования
uk: Налаштування SQLite Cache

source: SQLite cache storage directory and settings
ru_ru: Директория и настройки SQLite кэш
uk: Директорія для зберігання і налаштування SQLite кеша

source: Your WordPress installation parameters:
ru_ru: Параметры вашей установки WordPress:
uk: Параметри вашої установки WordPress:

source: WordPress installation ABSPATH constant
uk: Константа ABSPATH установки WordPress

source: This plugin directory
uk: Директорія цього плагіну

source: These settings will be applied for all WordPress sites installed into one common directory or for all sites of WordPress MultiSite installation. One SQLite cache database can serve dozens of sites.
ru_ru: Эти настройки будут применены ко всем WordPress-сайтам, установленным в одной папке или для всех сайтов в установке WordPress MultiSite. Одна база SQLite может работать как кэш для десятков сайтов.
uk: Ці налаштування будуть застосовані для всіх сайтів WordPress, встановлених в одній спільній теці або для всіх сайтів установки WordPress MultiSite. Одна база даних SQLite може служити як кеш для десятків сайтів.

source: SQLite database directory, full path
uk: Директорія бази даних SQLite, повний шлях

source: Compress cached data
ru_ru: Сжимать кэшированные данные
uk: Стискувати дані в кешу

source: Directory for cache is not defined yet. Enter path into the following field. If it is not exist the attempt to create it will be performed.
ru_ru: Директория для кэш еще не указана. Введите путь в соответствующем поле. Если она не существует, будет предпринята попытка создать её.
uk: Директорія для кеш ще не вказана. Введіть шлях у відповідному полі. Якщо вона не існує, буде зроблена спроба створити її.

source: To get cache working you must add manually the following lines in the top of %s file:
ru_ru: Чтобы кэширование заработало, нужно добавить следующие строки в начале файла %s.
uk: Для того щоб кешування запрацювало, потрібно додати наступні рядки на початку файлу %s.

source: %s per domain settings
ru_ru: Настройки для домена %s
uk: Налаштування для домена %s

source: File %s doesn't exist yet. Submit «%s» form to attempt create it.
ru_ru: Файл %s ещё не существует. Чтобы попробовать создать его, нажмите кнопку в форме «%s».
uk: Файл %s ще не існує. Щоб спробувати створити його, натисніть кнопку у формі «%s».

source: Cache is not active yet: you need to set cache expiration term. 1 hour = 3600 seconds, 1 day = 86400 seconds.
ru_ru: Кэширование еще не действует: нужно указать срок устаревания. 1 час = 3600 секунд, 1 сутки = 86400 секунд.
uk: Кешування ще не діє: потрібно вказати термін застарівання. 1 година = 3600 секунд, 1 доба = 86400 секунд.

source: Exclude cache for paths, one expression per line
ru_ru: Не кэшировать эти пути, по одному выражению на строку
uk: Не кешувати ці шляхи, по одному виразу на рядок

source: regular expression for <code>REQUEST_URI</code>. Leave empty field to cache all.
ru_ru: регулярное выражение для <code>REQUEST_URI</code>. Если пусто, то кэшируется всё.
uk: регулярний вираз для <code>request_uri</code>. Якщо порожньо, то кешуватиметься все.

source: Expire cached pages after
ru_ru: Кєшированные страницы устаревают через
uk: Збережені сторінки в кешу застарівають через

source: seconds
ru_ru: секунд
uk: секунд

source: Show performance time
ru_ru: Показывать время выполнения
uk: Показувати час виконання

source: for testing
ru_ru: для тестирования
uk: для тестування

source: Include HTTP headers
ru_ru: Включать HTTP-заголовки
uk: Додавати HTTP-заголовки

source: recommended to save traffic
ru_ru: рекомендуется для экономии траффика
uk: рекомендується для економії трафіку

source: Purge Cache for Domain
ru_ru: Очистить кэш для домена
uk: Очистити кеш для домена

source: Pattern to purge (substring of %s)
ru_ru: Шаблон для очистки (подстрока %s)
uk: Шаблон для очищення (підрядок %s)

source: Leave empty field to purge all.
ru_ru: Оставьте пустым, чтобы очистить всё.
uk: Залиште порожнім, щоб очистити все.

source: Purge Cache
ru_ru: Очистить кэш
uk: Очистити кеш

source: Cache is not used for authorized users and for visitors who has commenter's cookie (leaved a comment recently) or open PHP session.
ru_ru: Кэш не используется для залогиненных пользователей, для посетителей с установленным куком комментатора (кто недавно оставлял комментарий) или с открытой PHP сессией.
uk: Кеш не використовується для авторизованих користувачів, для відвідувачів зі встановленим куком коментатора (хто нещодавно залишив коментар) або з відкритою сесією PHP.

source: Cache of an updated/deleted/trashed page or single post will be cleared by the plugin automatically.
ru_ru: При обновлении/удалении/отправке в корзину страницы или записи её кэш очищается автоматически.
uk: При оновленні/видаленні/відправці в смітник сторінки або запису її кеш буде видалено автоматично.

source: Cache for a commented post or page on new comment will be cleared too.
ru_ru: Кэш страницы или записи при поступлении нового комментария тоже очищается.
uk: Кеш сторінки або запису при надходженні нового коментаря теж видалятиметься.

source: Don't forget to clear cache after switch theme, change widgets, editing menus and other actions affecting site look.
ru_ru: Не забывайте очищать кэш после смены темы, изменения виджетов, редактирования меню и других действий, влияющих на вид сайта.
uk: Не забувайте очищати кеш після зміни теми, віджетов, редагування меню і інших дій, що впливають на вигляд сайту.

source: To disable cache, deactivate the plugin. Remove inclusion of lite-cache.php from WordPress index.php before deleting the plugin.
ru_ru: Чтобы отключить кэш, деактивируйте плагин. Перед удалением плагина удалите подлючение lite-cache.php из файла WordPress index.php.
uk: Щоб відключити кеш, деактивуйте плагін. Перед видаленням плагіна видаліть підключення lite-cache.php в файлі WordPress index.php.

source: Can not create a directory.
ru_ru: Не удалось создать директорию.
uk: Не вдалося створити директорію.

source: This path is not a directory.
ru_ru: Этот путь не директория
uk: Цей шлях не директорія.

source: Database file has not been created.
ru_ru: База данных не была создана.
uk: Файл база даних не було створено.

source: litecache.ini file has not been created/rewritten in %s.
uk: Файл litecache.ini не було створено або переписано в %s.

source: Domain ini file has not been created/rewritten.
ru_ru: ini-файл для домена не был создан или перезаписан.
uk: ini-файл для домена не було створено або переписано в %s.

source: Cache has been cleaned.
ru_ru: Кэш почищен
uk: Кеш почищено.

source: SQLite database directory path, full path
ru_ru: Полный путь директории для базы данных SQLite

source: litecache.ini file has not been created/rewritten.
ru_ru: Файл litecache.ini не был создан или переписан.
